use library;

create table AUTHORS (
	author_id nvarchar(10),
    fio nvarchar(50),
    country nvarchar(30),
    primary key(author_id)
);

create table BOOKS (
	book_id nvarchar(10),
    title nvarchar(50),
    author nvarchar(10),
    released int,
    publisher nvarchar(20),
    primary key(book_id),
    foreign key(author) references AUTHORS(author_id)
);

select * from AUTHORS;
select * from BOOKS;

insert into AUTHORS values 
('СПКВСК','Анджей Сапковский','Польша'),
('ШКСПР','Уильям Шекспир','Англия'),
('РЛНГ','Джоан К. Роулинг','Англия'),
('БЛГКВ','Михаил Булгаков','СССР'),
('ТЛКН','Джон Р. Р. Толкин','Англия'),
('ТЛСТЙ','Лев Толстой','СССР'),
('РМРК','Эрих Мария Ремарк','Германия'),
('МТЧЛЛ','Маргарет Митчелл','США'),
('ОСТН','Джейн Остин','Англия'),
('ДЙЛ','Артур Конан Дойль','Англия'),
('ОРЛЛ','Джордж Оруэлл','Англия'),
('КРСТ','Агата Кристи','Англия'),
('ИСМ','Хадзимэ Исаяма','Япония');

insert into BOOKS values 
('ГПФК','Гарри Поттер и философский камень','РЛНГ',1997,'Росмэн'),
('ГПТК','Гарри Поттер и тайная комната','РЛНГ',1998,'Росмэн'),
('ГПУА','Гарри Поттер и узник Азкабана','РЛНГ',1999,'Росмэн'),
('ГПКО','Гарри Поттер и кубок огня','РЛНГ',2000,'Росмэн'),
('ГПОФ','Гарри Поттер и орден феникса','РЛНГ',2003,'Росмэн'),
('ГППП','Гарри Поттер и принц-полукровка','РЛНГ',2005,'Росмэн'),
('ГПДС','Гарри Поттер и дары смерти','РЛНГ',2007,'Росмэн'),
('ВПЖ','Последнее желание','СПКВСК',1986,'Росмэн'),
('ВМП','Меч Предназначения','СПКВСК',1992,'Росмэн'),
('ВКЭ','Кровь эльфов','СПКВСК',1994,'Росмэн'),
('ВЧП','Час Презрения','СПКВСК',1995,'Росмэн'),
('ВКО','Крещение огнём','СПКВСК',1996,'Росмэн'),
('ВБЛ','Башня Ласточки','СПКВСК',1997,'Росмэн'),
('ВВО','Владычица Озера','СПКВСК',1998,'Росмэн'),
('ВСГ','Сезон гроз','СПКВСК',2013,'Росмэн'),
('ХББТ','Хоббит, или Туда и обратно','ТЛКН',1937,'Гроза'),
('ВКБК','Властелин колец: Братство Кольца','ТЛКН',1954,'Гроза'),
('ВКДК','Властелин колец: Две крепости','ТЛКН',1954,'Гроза'),
('ВКВК','Властелин колец: Возвращение короля','ТЛКН',1954,'Гроза'),
('СЛМРЛЛН','Сильмариллион','ТЛКН',1977,'Гроза'),
('ГРДИПРДБ','Гордость и предубеждение','ОСТН',1813,'Гроза');

select * from BOOKS where released in(cast(year(CURDATE()) as signed),cast(year(CURDATE()) as signed) - 1);
select * from AUTHORS;

select AUTHORS.fio, count(title)
from BOOKS inner join AUTHORS 
	on BOOKS.author = AUTHORS.author_id
group by BOOKS.author having count(title) > 3;